[
  {
    "course_code": "CS112",
    "course_name": "Introduction to Programming Using Java",
    "credits": 3,
    "description": "CS/IS 112 is a course in programming computers using the Java programming language, which includes defining the problem, flowcharting, writing, executing, and debugging application programs, and program documentation. Lecture 2 hours/ Laboratory 3 hours.",
    "prerequisites": "Recommended Preparation: CS/IS 101 or equivalent",
    "offered": "Course Typically Offered: Fall/Spring/Summer",
    "transfer_credit": "Transfer Credit: CSU, UC, USC (C-ID COMP 112)",
    "status": "Completed"
  },
  {
    "course_code": "CS130",
    "course_name": "Introduction to Algorithms",
    "credits": 3,
    "description": "CS/IS 130 is a course in programming, algorithm development, and problem-solving using both object-oriented and structured approaches. It includes a study of syntax and data structures with applications in science, engineering, and industry. This course is suitable for students planning to transfer or those wishing to develop a marketable skill. Lecture 3 hours.",
    "prerequisites": "CS/IS 112 or equivalent",
    "offered": "Course Typically Offered: Fall/Spring",
    "transfer_credit": "Transfer Credit: CSU, UC, USC",
    "status": "Completed"
  },
  {
    "course_code": "CS151",
    "course_name": "Python Programming",
    "credits": 3,
    "description": "CS/IS 151 is a programming course in Python designed for individuals interested in becoming programmers or those with a curiosity for graphics and Graphical User Interface (GUI) programming. Python is a versatile language widely used in both business and game development. The course covers fundamental Python concepts and reviews essential computer science principles, including data types, decision structures, loops, functions, object-oriented programming, and introduces some basic graphics and GUI concepts. It offers a comprehensive foundation for Python programming and its real-world applications.",
    "prerequisites": "CS/IS 112 or equivalent",
    "offered": "Course Typically Offered: Spring (Every Other Year)",
    "transfer_credit": "Transfer Credit: CSU",
    "status": "Completed"
  },
  {
    "course_code": "CS135",
    "course_name": "Programming in C/C++",
    "credits": 3,
    "description": "CS/IS 135 is a course in programming using the C/C++ languages, with applications in real-time, business, and image processing systems, as well as systems programming. The course covers types, operators, control flow functions, object-oriented programming, classes, data abstraction, program structure, pointers, and arrays through programming assignments. Lecture 2 hours/Laboratory 3 hours.",
    "prerequisites": "CS/IS 112 or equivalent",
    "offered": "Course Typically Offered: Winter/Spring/Summer/Fall",
    "transfer_credit": "Transfer Credit: CSU, UC, USC (C-ID CS 122)",
    "status": "Completed"
  },
  {
    "course_code": "CS/IS 172",
    "course_name": "UNIX/LINUX Operating System",
    "credits": 4,
    "description": "CS/IS 172 discusses the various features of the UNIX and Linux operating systems. These operating systems are industry standard in modern computer systems. This course will be taught using current Linux distributions on Glendale Community College computers and on student home computers. Lecture/Demonstration 4 hours.",
    "prerequisites": "None",
    "offered": "Course Typically Offered: Fall (Every Other Year)",
    "transfer_credit": "Transfer Credit: CSU, UC, USC",
    "status": "Scheduled"
}

]
